### Module: etl_lambda
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details>
  <summary>Show Plan</summary>

  ```terraform
  module.masked_metrics.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::005133826942:policy/masked_metricsLogWriter]
module.unmasked_metrics.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::005133826942:policy/unmasked_metricsLogWriter]
aws_iam_role_policy_attachment.metrics_csv_vpc_networking: Refreshing state... [id=metrics_csv_lambda_role-20210506151610628500000001]
aws_iam_role_policy_attachment.metrics_csv_aggregate_streams: Refreshing state... [id=metrics_csv_lambda_role-20210506151610644500000003]
aws_iam_policy.aggregate_metrics_read: Refreshing state... [id=arn:aws:iam::005133826942:policy/AggregateMetricsRead]
aws_iam_role_policy_attachment.unmasked_metrics_csv_log_writer: Refreshing state... [id=metrics_csv_lambda_role-20210506153249662300000001]
aws_iam_role_policy_attachment.metrics_csv_s3_write: Refreshing state... [id=metrics_csv_lambda_role-20210506151611986400000004]
aws_iam_role_policy_attachment.metrics_csv_pull_create_csv_image: Refreshing state... [id=metrics_csv_lambda_role-20210506151610632200000002]
module.unmasked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/unmasked_metrics]
aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
module.masked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/masked_metrics]
aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]
module.unmasked_metrics.aws_lambda_function.lambda: Refreshing state... [id=unmasked_metrics]
module.masked_metrics.aws_lambda_function.lambda: Refreshing state... [id=masked_metrics]
aws_cloudwatch_event_target.tigger-masked_metrics: Refreshing state... [id=twice-a-day-masked_metrics]
aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.tigger-unmasked_metrics: Refreshing state... [id=twice-a-day-unmasked_metrics]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dyanmodb:ListShards",
              + "dynamodb:GetRecords",
              + "dynamodb:GetShardIterator",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::masked-metrics-snfsv-staging",
              + "arn:aws:s3:::unmasked-metrics-snfsv-staging",
            ]
        }
    }

  # aws_cloudwatch_event_rule.twice-a-day will be created
  + resource "aws_cloudwatch_event_rule" "twice-a-day" {
      + arn                 = (known after apply)
      + description         = "Fires twice a day"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "twice-a-day"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 6,18 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.tigger-masked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-masked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "masked_metrics"
    }

  # aws_cloudwatch_event_target.tigger-unmasked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-unmasked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "unmasked_metrics"
    }

  # aws_iam_policy.aggregate_metrics_read will be destroyed
  - resource "aws_iam_policy" "aggregate_metrics_read" {
      - arn       = "arn:aws:iam::005133826942:policy/AggregateMetricsRead" -> null
      - id        = "arn:aws:iam::005133826942:policy/AggregateMetricsRead" -> null
      - name      = "AggregateMetricsRead" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:GetRecords",
                          - "dyanmodb:ListShards",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAQCMP77N7KF5RZREJN" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_role.metrics_csv will be created
  + resource "aws_iam_role" "metrics_csv" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "metrics_csv_lambda_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_csv_lambda_role"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-masked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "masked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-unmasked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "unmasked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.masked_metrics.aws_cloudwatch_log_group.metric_log will be created
  + resource "aws_cloudwatch_log_group" "metric_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/masked_metrics"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_metrics.aws_iam_policy.write_logs will be destroyed
  - resource "aws_iam_policy" "write_logs" {
      - arn       = "arn:aws:iam::005133826942:policy/masked_metricsLogWriter" -> null
      - id        = "arn:aws:iam::005133826942:policy/masked_metricsLogWriter" -> null
      - name      = "masked_metricsLogWriter" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/masked_metrics"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAQCMP77N7FLOI7X2P7" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.masked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "masked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "masked-metrics-snfsv-staging"
              + "MASK_DATA"   = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_log_group.metric_log will be created
  + resource "aws_cloudwatch_log_group" "metric_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/unmasked_metrics"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_metrics.aws_iam_policy.write_logs will be destroyed
  - resource "aws_iam_policy" "write_logs" {
      - arn       = "arn:aws:iam::005133826942:policy/unmasked_metricsLogWriter" -> null
      - id        = "arn:aws:iam::005133826942:policy/unmasked_metricsLogWriter" -> null
      - name      = "unmasked_metricsLogWriter" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/unmasked_metrics"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAQCMP77N7PWGVZOM2Z" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.unmasked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "unmasked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "unmasked-metrics-snfsv-staging"
              + "MASK_DATA"   = "false"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
  ```
</details>